nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IA_Net, [16]] # 0-input adaptive enhancement
  - [-1, 1, Conv,  [64, 3, 2]] # 1-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 2-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 4-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]]
  - [-1, 1, DSConv,  [512, 3, 2]] # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DSConv,  [1024, 3, 2]] # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 9

head:
  # Keep HyperACE as the core innovation, then refine its output with MSDA.
  - [[5, 7, 9], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 10
  - [[5, 10, 9], 2, MSDA, [512, 8, 0.5]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [11, 1, DownsampleConv, [128]] # 13
  - [[7, 11], 1, FullPAD_Tunnel, []]  # 14
  - [[5, 12], 1, FullPAD_Tunnel, []]  # 15
  - [[9, 13], 1, FullPAD_Tunnel, []]  # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 14], 1, Concat, [1]] # 18
  - [-1, 2, DSC3k2, [512, True]] # 19
  - [[-1, 11], 1, FullPAD_Tunnel, []]  # 20

  - [19, 1, nn.Upsample, [None, 2, "nearest"]] # 21
  - [[-1, 15], 1, Concat, [1]] # 22
  - [-1, 2, DSC3k2, [256, True]] # 23
  - [12, 1, Conv, [256, 1, 1]] # 24
  - [[23, 24], 1, FullPAD_Tunnel, []]  # 25, P3

  - [25, 1, nn.Upsample, [None, 2, "nearest"]] # 26
  - [[-1, 3], 1, Concat, [1]] # 27, cat backbone P2
  - [-1, 2, DSC3k2, [256, True]] # 28, P2/4

  - [25, 1, Conv, [256, 3, 2]] # 29
  - [[-1, 20], 1, Concat, [1]] # 30
  - [-1, 2, DSC3k2, [512, True]] # 31, P4
  - [[-1, 11], 1, FullPAD_Tunnel, []] # 32

  - [31, 1, Conv, [512, 3, 2]] # 33
  - [[-1, 16], 1, Concat, [1]] # 34
  - [-1, 2, DSC3k2, [1024, True]] # 35, P5
  - [[-1, 13], 1, FullPAD_Tunnel, []] # 36

  - [[28, 25, 32, 36], 1, Detect, [nc]] # 37 Detect(P2, P3, P4, P5)
