nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

# 中等版本: 保留 HyperACE + MSDA，移除 IA_Net 和 P2
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]]
  - [-1, 1, DSConv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DSConv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

head:
  # HyperACE + MSDA 组合
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  - [[4, 9, 8], 1, MSDA, [512, 8, 0.5]] # 10 (减少repeats到1)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [10, 1, DownsampleConv, [128]] # 12
  - [[6, 10], 1, FullPAD_Tunnel, []]  # 13
  - [[4, 11], 1, FullPAD_Tunnel, []]  # 14
  - [[8, 12], 1, FullPAD_Tunnel, []]  # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 13], 1, Concat, [1]] # 17
  - [-1, 2, DSC3k2, [512, True]] # 18
  - [[-1, 10], 1, FullPAD_Tunnel, []]  # 19

  - [18, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [[-1, 14], 1, Concat, [1]] # 21
  - [-1, 2, DSC3k2, [256, True]] # 22
  - [11, 1, Conv, [256, 1, 1]] # 23
  - [[22, 23], 1, FullPAD_Tunnel, []]  # 24, P3

  - [24, 1, Conv, [256, 3, 2]] # 25
  - [[-1, 19], 1, Concat, [1]] # 26
  - [-1, 2, DSC3k2, [512, True]] # 27, P4
  - [[-1, 10], 1, FullPAD_Tunnel, []]  # 28

  - [27, 1, Conv, [512, 3, 2]] # 29
  - [[-1, 15], 1, Concat, [1]] # 30
  - [-1, 2, DSC3k2, [1024, True]] # 31, P5
  - [[-1, 12], 1, FullPAD_Tunnel, []]  # 32

  - [[24, 28, 32], 1, Detect, [nc]] # 33 Detect(P3, P4, P5)
